In [18]:
import pandas as pd
import numpy as np

In [19]:
dictionary = {'D': 10, 'B': 20, 'C': 30}
series=pd.Series(dictionary)

In [20]:
df=pd.DataFrame(series)

In [21]:
for i in range(5):
    df[i]=pd.Series(dictionary)

In [22]:
df

    0   1   2   3   4
D  10  10  10  10  10
B  20  20  20  20  20
C  30  30  30  30  30

In [27]:
df=pd.read_excel("kayitlar.xlsx")
len(df.columns)

8

In [40]:
df.columns=[i for i in range(len(df.columns))]

In [41]:
df

,0,1,2,3,4,5,6,7
0,carID,9.00,12.00,15.00,18.00,19.00,22.0,24.00
1,speed2,103.73,87.24,76.84,97.54,76.84,81.0,69.68
2,asma,72.88,45.40,28.07,62.56,28.07,35.0,16.13
3,ceza_tutar,6440.00,3136.00,1508.50,6440.00,1508.50,3136.0,1508.50
4,hesaplanan_asma,50.00,30.00,10.00,50.00,10.00,30.0,10.00

In [44]:
df2=pd.read_excel("kayitlarx.xlsx")

In [47]:
df2.pop("Unnamed: 0")

0    0
1    1
2    2
3    3
4    4
Name: Unnamed: 0, dtype: int64

In [48]:
df2

                 0        1        2        3        4        5     6        7
0            carID     9.00    12.00    15.00    18.00    19.00    22    24.00
1           speed2   103.73    87.24    76.84    97.54    76.84    81    69.68
2             asma    72.88    45.40    28.07    62.56    28.07    35    16.13
3       ceza_tutar  6440.00  3136.00  1508.50  6440.00  1508.50  3136  1508.50
4  hesaplanan_asma    50.00    30.00    10.00    50.00    10.00    30    10.00

In [58]:
df2.index=df2[0]

In [60]:
df2.pop(0)

0
carID                        carID
speed2                      speed2
asma                          asma
ceza_tutar              ceza_tutar
hesaplanan_asma    hesaplanan_asma
Name: 0, dtype: object

In [63]:
df2

                       1        2        3        4        5     6        7
0
carID               9.00    12.00    15.00    18.00    19.00    22    24.00
speed2            103.73    87.24    76.84    97.54    76.84    81    69.68
asma               72.88    45.40    28.07    62.56    28.07    35    16.13
ceza_tutar       6440.00  3136.00  1508.50  6440.00  1508.50  3136  1508.50
hesaplanan_asma    50.00    30.00    10.00    50.00    10.00    30    10.00

In [70]:
print(f"""{df2[1][0]} numarali arac {df2[1][0]} Km/h ile hiz sinirini %{df2[1][0]} oraninda asmistir.
	{df2[1][0]} numarali aracin hiz sinirini %{df2[1][0]}'den fazla astigi tespit edildiginden dolayi cezai islem uygulanmistir.
	Yazilan ceza tutari:{df2[1][0]} TL.""")

9.0 numarali arac 9.0 Km/h ile hiz sinirini %9.0 oraninda asmistir.
	9.0 numarali aracin hiz sinirini %9.0'den fazla astigi tespit edildiginden dolayi cezai islem uygulanmistir.
	Yazilan ceza tutari:9.0 TL.

/tmp/ipykernel_19099/785623018.py:1: FutureWarning: Series.__getitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To access a value by position, use `ser.iloc[pos]`
  print(f"""{df2[1][0]} numarali arac {df2[1][0]} Km/h ile hiz sinirini %{df2[1][0]} oraninda asmistir.
/tmp/ipykernel_19099/785623018.py:2: FutureWarning: Series.__getitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To access a value by position, use `ser.iloc[pos]`
  {df2[1][0]} numarali aracin hiz sinirini %{df2[1][0]}'den fazla astigi tespit edildiginden dolayi cezai islem uygulanmistir.
/tmp/ipykernel_19099/785623018.py:3: FutureWarning: Series.__getitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To access a value by position, use `ser.iloc[pos]`
  Yazilan ceza tutari:{df2[1][0]} TL.""")

In [79]:
for i in range(len(df2.columns)):
    print(df[i].iloc[1])

speed2
103.73
87.24
76.84
97.54
76.84
81.0